avrxml/AS6-Devices-XML/ATSAM3N2C.xml
        <register offset="0x00000301" size="1" name="NVICIP1" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI1" caption="Priority of interrupt 1"/>
        </register>
        <register offset="0x00000302" size="1" name="NVICIP2" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI2" caption="Priority of interrupt 2"/>
        </register>
        <register offset="0x00000303" size="1" name="NVICIP3" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI3" caption="Priority of interrupt 3"/>
        </register>
        <register offset="0x00000304" size="1" name="NVICIP4" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI4" caption="Priority of interrupt 4"/>
        </register>
        <register offset="0x00000305" size="1" name="NVICIP5" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI5" caption="Priority of interrupt 5"/>
        </register>
        <register offset="0x00000306" size="1" name="NVICIP6" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI6" caption="Priority of interrupt 6"/>
        </register>
        <register offset="0x00000307" size="1" name="NVICIP7" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI7" caption="Priority of interrupt 7"/>
        </register>
        <register offset="0x00000308" size="1" name="NVICIP8" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI8" caption="Priority of interrupt 8"/>
        </register>
        <register offset="0x00000309" size="1" name="NVICIP9" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI9" caption="Priority of interrupt 9"/>
        </register>
        <register offset="0x0000030a" size="1" name="NVICIP10" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI10" caption="Priority of interrupt 10"/>
        </register>
        <register offset="0x0000030b" size="1" name="NVICIP11" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI11" caption="Priority of interrupt 11"/>
        </register>
        <register offset="0x0000030c" size="1" name="NVICIP12" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI12" caption="Priority of interrupt 12"/>
        </register>
        <register offset="0x0000030d" size="1" name="NVICIP13" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI13" caption="Priority of interrupt 13"/>
        </register>
        <register offset="0x0000030e" size="1" name="NVICIP14" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI14" caption="Priority of interrupt 14"/>
        </register>
        <register offset="0x0000030f" size="1" name="NVICIP15" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI15" caption="Priority of interrupt 15"/>
        </register>
        <register offset="0x00000310" size="1" name="NVICIP16" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI16" caption="Priority of interrupt 16"/>
        </register>
        <register offset="0x00000311" size="1" name="NVICIP17" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI17" caption="Priority of interrupt 17"/>
        </register>
        <register offset="0x00000312" size="1" name="NVICIP18" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI18" caption="Priority of interrupt 18"/>
        </register>
        <register offset="0x00000313" size="1" name="NVICIP19" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI19" caption="Priority of interrupt 19"/>
        </register>
        <register offset="0x00000314" size="1" name="NVICIP20" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
        </register>
        <register offset="0x00000315" size="1" name="NVICIP21" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI21" caption="Priority of interrupt 21"/>
        </register>
        <register offset="0x00000316" size="1" name="NVICIP22" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI22" caption="Priority of interrupt 22"/>
        </register>
        <register offset="0x00000317" size="1" name="NVICIP23" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="1" name="NVICIP24" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
        </register>
        <register offset="0x00000319" size="1" name="NVICIP25" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI25" caption="Priority of interrupt 25"/>
        </register>
        <register offset="0x0000031a" size="1" name="NVICIP26" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI26" caption="Priority of interrupt 26"/>
        </register>
        <register offset="0x0000031b" size="1" name="NVICIP27" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031c" size="1" name="NVICIP28" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
        </register>
        <register offset="0x0000031d" size="1" name="NVICIP29" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI29" caption="Priority of interrupt 29"/>
        </register>
        <register offset="0x0000031e" size="1" name="NVICIP30" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI30" caption="Priority of interrupt 30"/>
        </register>
        <register offset="0x0000031f" size="1" name="NVICIP31" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
        <register offset="0x00000320" size="1" name="NVICIP32" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI32" caption="Priority of interrupt 32"/>
        </register>
        <register offset="0x00000321" size="1" name="NVICIP33" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI33" caption="Priority of interrupt 33"/>
        </register>
        <register offset="0x00000322" size="1" name="NVICIP34" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI34" caption="Priority of interrupt 34"/>
        </register>
