avrxml/AS6-Devices-XML/ATSAM3N2C.xml
        <register offset="0x0000035d" size="1" name="NVICIP93" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI93" caption="Priority of interrupt 93"/>
        </register>
        <register offset="0x0000035e" size="1" name="NVICIP94" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI94" caption="Priority of interrupt 94"/>
        </register>
        <register offset="0x0000035f" size="1" name="NVICIP95" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI95" caption="Priority of interrupt 95"/>
        </register>
        <register offset="0x00000360" size="1" name="NVICIP96" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI96" caption="Priority of interrupt 96"/>
        </register>
        <register offset="0x00000361" size="1" name="NVICIP97" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI97" caption="Priority of interrupt 97"/>
        </register>
        <register offset="0x00000362" size="1" name="NVICIP98" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI98" caption="Priority of interrupt 98"/>
        </register>
        <register offset="0x00000363" size="1" name="NVICIP99" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI99" caption="Priority of interrupt 99"/>
        </register>
        <register offset="0x00000364" size="1" name="NVICIP100" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI100" caption="Priority of interrupt 100"/>
        </register>
        <register offset="0x00000365" size="1" name="NVICIP101" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI101" caption="Priority of interrupt 101"/>
        </register>
        <register offset="0x00000366" size="1" name="NVICIP102" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI102" caption="Priority of interrupt 102"/>
        </register>
        <register offset="0x00000367" size="1" name="NVICIP103" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI103" caption="Priority of interrupt 103"/>
        </register>
        <register offset="0x00000368" size="1" name="NVICIP104" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI104" caption="Priority of interrupt 104"/>
        </register>
        <register offset="0x00000369" size="1" name="NVICIP105" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI105" caption="Priority of interrupt 105"/>
        </register>
        <register offset="0x00000e00" size="4" name="NVICSTIR" initval="0" caption="Software Trigger Interrupt Register">
          <bitfield mask="0x000001ff" name="INTID" caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
        </register>
      </register-group>
    </module>
  </modules>
</avr-tools-device-file>